net8/private/Payments/Tests/HR.LoadTests/JMeter/PX/GetPaymentSession.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Get_PaymentSessionAPI">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GetPaymentSession">
        <intProp name="ThreadGroup.num_threads">215</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <longProp name="ThreadGroup.duration">1800</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">x-ms-flight</stringProp>
              <stringProp name="Header.value">LoadTest</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request-GetPaymentSession">
          <stringProp name="HTTPSampler.domain">paymentinstruments.mp.microsoft.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v6.0/users/me/PaymentSessionDescriptions?paymentSessionData=%7B%22id%22%3A%22%22%2C%22isChallengeRequired%22%3Afalse%2C%22challengeStatus%22%3A%22%22%2C%22signature%22%3A%22%22%2C%22amount%22%3A0.99%2C%22challengeScenario%22%3A%22PaymentTransaction%22%2C%22challengeWindowSize%22%3A%2205%22%2C%22currency%22%3A%22USD%22%2C%22country%22%3A%22US%22%2C%22language%22%3A%22en-US%22%2C%22partner%22%3A%22cart%22%2C%22piid%22%3A%22%2BRtjUgIAAAABAACA%22%7D&amp;operation=Add</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">200</stringProp>
          </ConstantTimer>
          <hashTree/>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer">
            <collectionProp name="load_profile">
              <collectionProp name="-238506943">
                <stringProp name="1598">20</stringProp>
                <stringProp name="1598">20</stringProp>
                <stringProp name="1629">30</stringProp>
              </collectionProp>
              <collectionProp name="-206879999">
                <stringProp name="1660">40</stringProp>
                <stringProp name="1660">40</stringProp>
                <stringProp name="1629">30</stringProp>
              </collectionProp>
              <collectionProp name="-172469824">
                <stringProp name="1754">71</stringProp>
                <stringProp name="1754">71</stringProp>
                <stringProp name="1722">60</stringProp>
              </collectionProp>
              <collectionProp name="546599556">
                <stringProp name="48625">100</stringProp>
                <stringProp name="48625">100</stringProp>
                <stringProp name="60">60</stringProp>
              </collectionProp>
              <collectionProp name="-1869152596">
                <stringProp name="48751">142</stringProp>
                <stringProp name="48751">142</stringProp>
                <stringProp name="48687">120</stringProp>
              </collectionProp>
              <collectionProp name="2112220843">
                <stringProp name="49620">213</stringProp>
                <stringProp name="49620">213</stringProp>
                <stringProp name="1512228">1500</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
        </hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="false">
          <intProp name="calcMode">2</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>12780.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>